"""
    문제
        사용자로부터 정수를 입력받아, 그 크기만큼 '#' 문자로 정사각형을 출력하는 코드를 작성하시오.

    출력 예시:
        정사각형의 크기를 입력하세요: 10

        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
        # # # # # # # # # # 
"""
def main():
    try:
        num = int(input("정사각형의 크기를 입력하세요: "))
        for j in range(1, num+1):
            print()
            for i in range(1, num+1):
                print("# ",end="")
    except ValueError:
        print("정수를 입력하세요")
        
if __name__ == "__main__":
    main()